const STATUSES = {
  0: 'Заявка',
  1: 'Оброблений',
  2: 'В Рекламі'
}

const CONTRACTS = ['НЕД', 'ЕД']
const MOTIVATIONS = ['A', 'B', 'C', 'AA']

const SOURCES = {
  1: 'Особистий агента',
  2: 'Пошук квартири',
  3: 'Сайти',
  4: 'olx.ua',
  5: 'domria.com',
  6: 'mesto.ua',
  7: 'Vlasnyky-rv.at.ua',
  8: 'Розклейка',
  9: 'Куплю',
  10: 'Реклама послуг',
  11: 'Внутрішня база  Архів',
  12: 'Заміна',
  13: 'Бази власників',
  14: 'Рента',
  15: 'Реально',
  16: 'Газети',
  17: 'Інше АН',
  18: 'Соціальні мережі',
  19: 'Реклама АН',
  20: 'Зовнішня реклама',
  21: 'Соц. мережі',
  22: 'Інстаграм',
  23: 'Сторінка HalDen.estate  Фейсбук',
  24: 'Ютуб',
  25: 'Сайт HalDen.estate',
  26: 'Реклама по сайтах',
  27: 'Рекомендація',
  28: 'Знайомий',
  29: 'Колега',
  30: 'Ключова людина',
  31: 'Повторне звернення',
  32: 'Невідомо'
}

const ARCHIVED_REASONS = {
  1: 'Під Завдатком',
  2: 'Продано',
  3: 'Продано за Ціну',
  4: 'Передумали',
  5: 'Призупинили Продаж'
}

module.exports = { STATUSES, CONTRACTS, MOTIVATIONS, SOURCES, ARCHIVED_REASONS }
