const PROPERTY_TYPES = ['House', 'Apartment', 'Commerce']

const SOURCES = {
  1: 'Особистий агента',
  2: 'Реклама НЕД olx.ua',
  3: 'Реклама НЕД domria.com',
  4: 'Реклама НЕД mesto.ua',
  5: 'Реклама НЕД Vlasnyky-rv.at.ua',
  6: 'Реклама НЕД Розклейка',
  7: 'Реклама НЕД Instagram',
  8: 'Реклама НЕД Facebook',
  9: 'Реклама НЕД Газети',
  10: 'Реклама НЕД Сайт halden.estate',

  11: 'Інше АН',

  12: 'Реклама АН Зовнішня реклама',
  13: 'Реклама АН Instagram',
  14: 'Реклама АН Facebook',
  15: 'Реклама АН YouTube',
  16: 'Реклама АН Сайт halden.estate',
  17: 'Реклама АН Розклейка по сайтах',
  18: 'Реклама АН Рекомендація Знайомий',
  19: 'Реклама АН Рекомендація Колега',
  20: 'Реклама АН Рекомендація Ключова людина',
  21: 'Реклама АН Невідомо',
  22: 'Реклама АН Внутрішня база Архів',
  23: 'Реклама АН Внутрішня база Заміна',
  24: 'Реклама АН Повторне звернення',

  25: 'Реклама ЕД olx.ua',
  26: 'Реклама ЕД domria.com',
  27: 'Реклама ЕД mesto.ua',
  28: 'Реклама ЕД vlasnyky-rv.at.ua',
  29: 'Реклама ЕД Розклейка "Продам"',
  30: 'Реклама ЕД Instagram',
  31: 'Реклама ЕД Facebook',
  32: 'Реклама ЕД Баннер',
  33: 'Реклама ЕД Газети',
  34: 'Реклама ЕД Хенгери',
  35: 'Реклама ЕД YouTube'
}

const APT_FLOORS = {
  0: 'Перший',
  1: 'Середній',
  2: 'Останній'
}

const HOUSE_RANGES = {
  0: 'Місто',
  1: 'До 5 км.',
  2: 'Від 5 км.'
}

module.exports = { PROPERTY_TYPES, SOURCES, APT_FLOORS, HOUSE_RANGES }
